1cdiplom/src/Documents/ОбслуживаниеКлиента/ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеФайлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1cdiplom/src/InformationRegisters/УсловияОплатыСотрудников/УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1cdiplom/src/Documents/ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УсловияОплатыСотрудников.ПроцентОтРабот КАК Процент
		|ИЗ
		|	РегистрСведений.УсловияОплатыСотрудников КАК УсловияОплатыСотрудников
		|ГДЕ
		|	УсловияОплатыСотрудников.Сотрудник = &Сотрудник
		|	И УсловияОплатыСотрудников.Период >= &НачалоПериод
		|   И УсловияОплатыСотрудников.Период <= &КонецПериод";
	
	Запрос.УстановитьПараметр("Сотрудник", Объект.Специалист);
	Запрос.УстановитьПараметр("НачалоПериод", Объект.ВремяНачалаРабот);
	Запрос.УстановитьПараметр("КонецПериод", Объект.ВремяОкончанияРабот);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Не ЗначениеЗаполнено(Выборка.Процент) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для текущего специалиста не назначен процент оплаты от выполенных работ!";
			Сообщение.Сообщить();
		Иначе
			Работа = Объект.РегистрыНакопления.ВыполненныеСотрудникомРаботы.Добавить();
			Работа.Сотрудник = Объект.Специалист;
			
			КоличествоЧасов = 0;
			
			Для Каждого Строка Из Объект.ВыполненныеРаботы Цикл
				КоличествоЧасов = КоличествоЧасов + Строка.ЧасыКОплатеКлиенту;
			КонецЦикла;		
			
			Работа.ЧасовКОплате = КоличествоЧасов;
			Работа.СуммаКОплате = (КоличествоЧасов * Объект.Договор.СтоимостьЧасаРаботыСпециалиста * Выборка.Процент) / 100;
			Работа.Записать(Истина);
		КонецЕсли;				
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

    // Проверяем, является ли документ новым
    НовыйДокумент = Объект.Ссылка.Пустая(); 
Сообщить ("Дата"+ Формат(Объект.Дата, "ДЛФ=Д") + "    Время"+ Формат(Объект.Дата, "ЧЧ:мм")+Объект.Специалист);
    // Сохраняем старые значения для сравнения
    ДатаСтарое = Формат(Объект.Дата, "ДЛФ=Д"); 
    ВремяСтарое = Формат(Объект.Дата, "ЧЧ:мм:сс"); 
    СпециалистСтарое = Объект.Специалист;
Сообщить (ДатаСтарое + "    Время"+ ВремяСтарое+Объект.Специалист);
    // Если документ новый или изменились дата, время или специалист
    Если НовыйДокумент Или 
      (Формат(Объект.Дата, "ДЛФ=Д") <> ДатаСтарое) Или 
       (Формат(Объект.Дата, "ЧЧ:мм:сс") <> ВремяСтарое) Или 
       (Объект.Специалист <> СпециалистСтарое) Тогда

        // Формируем текст сообщения
        ТекстСообщения = "Изменения в документе 'Обслуживание клиента':" + Символы.ПС;
        
        Если НовыйДокумент Тогда
            ТекстСообщения = ТекстСообщения + "Документ создан." + Символы.ПС;
        КонецЕсли;
        
 
        Если Формат(Объект.Дата, "ДЛФ=Д") <> ДатаСтарое Тогда
            ТекстСообщения = ТекстСообщения + "Дата изменена на: " + Формат(Элементы.Дата, "ДЛФ=Д") + Символы.ПС;
        КонецЕсли;

        Если Формат(Объект.Дата, "ЧЧ:мм:сс") <> ВремяСтарое Тогда
            ТекстСообщения = ТекстСообщения + "Время изменено на: " + Формат(Элементы.Дата, "ЧЧ:ММ:СС") + Символы.ПС;
        КонецЕсли;

        Если Объект.Специалист <> СпециалистСтарое Тогда
            ТекстСообщения = ТекстСообщения + "Специалист изменен на: " + Элементы.Специалист.Наименование + Символы.ПС;
        КонецЕсли;
        Если ТекстСообщения <> "Изменения в документе 'Обслуживание клиента':"+ Символы.ПС Тогда
   			 ОтправитьСообщениеВTelegram(ТекстСообщения, "7632006077:AAEU_aAvtovlEtBYFHWmJkummebZVDVfYlQ", "-1002614991547");
		КонецЕсли;
        // Добавляем запись в справочник "УведомленияТелеграмботу"
        //@skip-check undefined-variable
        Уведомление = Справочники.УведомленияТелеграмботу.СоздатьЭлемент();
        Уведомление.ТекстСообщения = ТекстСообщения;
        Уведомление.Записать();	
    КонецЕсли;
КонецПроцедуры

Процедура ОтправитьСообщениеВTelegram(ТекстСообщения, Token, ChatID)

    // Адрес запроса к Telegram API
    URL = "https://api.telegram.org/bot" + Token + "/sendMessage";

    // Формируем тело запроса в формате application/x-www-form-urlencoded
    ТелоЗапроса = "chat_id=" + СтрЗаменить(ChatID, "+", "%2B") +
                  "&text=" + ТекстСообщения;

    // Устанавливаем заголовки
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");

    // Создаем защищенное HTTPS-соединение
    Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());

    // Создаем HTTP-запрос
    Запрос = Новый HTTPЗапрос("/bot" + Token + "/sendMessage", Заголовки);
    Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);

    // Отправляем запрос
    Результат = Соединение.ОтправитьДляОбработки(Запрос);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	 Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.МножественныйВыбор = Ложь;
    Если Диалог.Выбрать() Тогда
        ПутьКФайлу = Диалог.ПолноеИмяФайла;
        ПозицияПоследнейТочкиВПолномИмениФайла = СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца,,1);
        ПозицияПоследнегоСловаСлева = СтрНайти(ПутьКФайлу,"\", НаправлениеПоиска.СКонца,,1);
        РасширениеИзДиалога = Прав(ПутьКФайлу,СтрДлина(ПутьКФайлу) - ПозицияПоследнейТочкиВПолномИмениФайла);
        ИмяФайлаДиалог = Сред(ПутьКФайлу, ПозицияПоследнегоСловаСлева + 1, ПозицияПоследнейТочкиВПолномИмениФайла - ПозицияПоследнегоСловаСлева - 1);    
    КонецЕсли; 
    
    Если Не ПутьКФайлу = "" Тогда
        ОткрытьФайлНаСервере();
        Элементы.ПосмотретьФайл.Доступность = Истина;
    Иначе
        Сообщить("Файл не выбран");
    КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ОткрытьФайлНаСервере()   
    
 ДокументОбъект = РеквизитФормыВЗначение("Объект"); //заись всего объекта конфигурации в переменную, чтобы обратиться потом к реквизиту с типом ХранилищеЗначения
  ДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу); //запись в переменную данных из реквизита ПутьКФайлу прибразованные в двоичные 
  КоличествоСтрок = ДокументОбъект.ПрикрепленныеФайлы.Количество();      // колво строк в табличной части, чтобы понимать к какой обращаться в те кущий момент
  ДокументОбъект.ПрикрепленныеФайлы.Добавить();
  ДокументОбъект.ПрикрепленныеФайлы[КоличествоСтрок].Файл = Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных(9));
  ДокументОбъект.ПрикрепленныеФайлы[КоличествоСтрок].ИмяФайла = ИмяФайлаДиалог;
  ДокументОбъект.ПрикрепленныеФайлы[КоличествоСтрок].РасширениеФайла = РасширениеИзДиалога;
  ДокументОбъект.Записать();
  ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
    
    
КонецПроцедуры
&НаКлиенте
Процедура ПосмотретьФайл(Команда)
НомерТекущейСтроки = Элементы.ПрикрепленныеФайлы.ТекущиеДанные.НомерСтроки;
  ПросмотретьФайлНаСервере(НомерТекущейСтроки);
КонецПроцедуры

&НаСервере
Процедура ПросмотретьФайлНаСервере(НомерСтроки)
    
   ДокументОбъект = РеквизитФормыВЗначение("Объект");   
   Путь = ПолучитьИмяВременногоФайла(ДокументОбъект.ПрикрепленныеФайлы[НомерСтроки-1].РасширениеФайла);
   Данные = ДокументОбъект.ПрикрепленныеФайлы[НомерСтроки-1].Файл.Получить();
   Данные.Записать(Путь);
   ЗапуститьПриложение(Путь);
   ЗначениеВРеквизитФормы(ДокументОбъект,"Объект"); 
    
    
КонецПроцедуры 
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
    
  ПриОткрытииНаСервере();    
  Если Объект.ПрикрепленныеФайлы.Количество() > 0 Тогда
    Элементы.ПосмотретьФайл.Доступность = Истина;
  Иначе
    Элементы.ПосмотретьФайл.Доступность = Ложь;
КонецЕсли;   

КонецПроцедуры  


&НаСервере
Процедура ПриОткрытииНаСервере() 
    
КонецПроцедуры
